man/README.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>README</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-01-25 12:59:06 CST"/>
<meta name="author" content="PECAN User"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">README</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Overview </a>
<ul>
<li><a href="#sec-1.1">1.1 For more information about the individual modules in PEcAn, please see the Module Documentation </a></li>
<li><a href="#sec-1.2">1.2 To run a multi-run PEcAn example from the desktop: </a></li>
<li><a href="#sec-1.3">1.3 To run the above analysis from the terminal: </a></li>
<li><a href="#sec-1.4">1.4 To run a single ED and pecan test cases from the terminal: </a>
<ul>
<li><a href="#sec-1.4.1">1.4.1 ED </a></li>
<li><a href="#sec-1.4.2">1.4.2 PEcAn </a></li>
</ul>
</li>
<li><a href="#sec-1.5">1.5 To reproduce the manuscript </a></li>
</ul>
</li>
<li><a href="#sec-2">2 Advanced </a>
<ul>
<li><a href="#sec-2.1">2.1 To setup runs on a server: </a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Overview </h2>
<div class="outline-text-2" id="text-1">


<p>
The analysis from LeBauer et al (201x) can be reproduced, with the exception of running the ED2 Model, completely within this Virtual Machine. To run with the ED2 model, see the "advanced" section below.
</p>

</div>

<div id="outline-container-1.1" class="outline-3">
<h3 id="sec-1.1"><span class="section-number-3">1.1</span> For more information about the individual modules in PEcAn, please see the <a href="/home/pecan/pecan/man/Module_Documentation.html">Module Documentation</a> </h3>
<div class="outline-text-3" id="text-1.1">

</div>

</div>

<div id="outline-container-1.2" class="outline-3">
<h3 id="sec-1.2"><span class="section-number-3">1.2</span> To run a multi-run PEcAn example from the desktop: </h3>
<div class="outline-text-3" id="text-1.2">

<ol>
<li>
Double-click the "Clean" icon in the lower left-hand side of the desktop before starting a new run.
</li>
<li>
The settings.xml file is the PEcAn configuration file for this test run.
<ul>
<li>
this file includes the paths to all model inputs, model executable, and database login information.
</li>
<li>
To start an example analysis, the file path should be set to "/home/pecan/in/ebifarm/fast/pavi.xml" and then save.
</li>
<li>
Definitions of the settings file contents can be found at the <a href="http://128.174.125.122/wiki/index.php/PECAn_Documentation:Use#Settings_File">PEcAn wiki</a>
</li>
<li>
NB: the settings files used to generate the manuscript are in <a href="/home/pecan/in/ebifarm/prior/pavi.xml">~/in/ebifarm/prior/pavi.xml</a> and <a href="/home/pecan/in/ebifarm/post/pavi.xml">~/in/ebifarm/post/pavi.xml</a> however, these require access to a high performance computer (See "Advanced", below) - one could copy the &lt;run&gt;&lt;host&gt; settings from the <a href="/home/pecan/Desktop/settings.xml">~/Desktop/settings.xml</a> file, but it would take on the order of 4 months to finish. 
</li>
</ul>
</li>
<li>
Right-click the Query DB module and select "open with bash". 
<ul>
<li>
A bash terminal will open and display the output of the Query DB module 
</li>
<li>
The log file "querydb.log" will appear on the desktop.
</li>
<li>
Read the log file before proceeding to the next step.
</li>
</ul>
</li>
<li>
Repeat step 3 for each of the modules on the top row of the desktop.
<ul>
<li>
A log file will appear for each module.
</li>
</ul>
</li>
<li>
Double-click the "Clean" module to remove output and log files 

</li>
</ol>
</div>

</div>

<div id="outline-container-1.3" class="outline-3">
<h3 id="sec-1.3"><span class="section-number-3">1.3</span> To run the above analysis from the terminal: </h3>
<div class="outline-text-3" id="text-1.3">

<ol>
<li>
Right-click on desktop and select "open terminal here"
</li>
<li>
in the terminal, issue the following commands:


</li>
</ol>


<pre class="example">CONFIG="/home/pecan/Desktop/settings.xml"
cd /home/pecan/pecan
./bash/query.bety.sh $CONFIG
./bash/meta.analysis.sh $CONFIG
./bash/write.configs.sh $CONFIG
./bash/start.runs.sh $CONFIG
./bash/get.model.output.sh $CONFIG
./bash/sensitivity.analysis.sh $CONFIG
</pre>



</div>

</div>

<div id="outline-container-1.4" class="outline-3">
<h3 id="sec-1.4"><span class="section-number-3">1.4</span> To run a single ED and pecan test cases from the terminal: </h3>
<div class="outline-text-3" id="text-1.4">


</div>

<div id="outline-container-1.4.1" class="outline-4">
<h4 id="sec-1.4.1"><span class="section-number-4">1.4.1</span> ED </h4>
<div class="outline-text-4" id="text-1.4.1">




<pre class="example">cd ~/testrun.ed
ed2
</pre>



</div>

</div>

<div id="outline-container-1.4.2" class="outline-4">
<h4 id="sec-1.4.2"><span class="section-number-4">1.4.2</span> PEcAn </h4>
<div class="outline-text-4" id="text-1.4.2">




<pre class="example">cd ~/testrun.pecan
./runall.sh
</pre>



</div>
</div>

</div>

<div id="outline-container-1.5" class="outline-3">
<h3 id="sec-1.5"><span class="section-number-3">1.5</span> To reproduce the manuscript </h3>
<div class="outline-text-3" id="text-1.5">


<p>
The following commands will re-generate the manuscript using output contained in the <i>home/pecan/manuscript/out/ebifarm</i> folders named "prior" and "post":
</p>



<pre class="example">cd /home/pecan/manuscript/

R CMD Sweave priors.Rnw
R CMD Sweave results.Rnw

pdflatex manuscript
pdflatex manuscript
bibtex manuscript
pdflatex manuscript
pdflatex manuscript

evince manuscript.pdf
</pre>




<p>
Note that the "start.runs" step would launch 1200 runs and take a very long time; this is intended for use with a high performance computer.
</p>



<pre class="example">cd /home/pecan/pecan

for config in prior post
do
CONFIG="/home/pecan/in/ebifarm/$config/pavi.xml"
./bash/query.bety.sh $CONFIG
./bash/meta.analysis.sh $CONFIG
./bash/write.configs.sh $CONFIG
./bash/start.runs.sh $CONFIG
./bash/get.model.output.sh $CONFIG
./bash/sensitivity.analysis.sh $CONFIG
done

./bash/write.manuscript.sh ~/manuscript/

</pre>


</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Advanced </h2>
<div class="outline-text-2" id="text-2">

<p>A High Performance Computer is required to run the ~1200 realizations of the ED2 model required for the present analysis. Output from these runs is provided in the ~/out/ebifarm/post and ~/out/ebifarm/prior/ folders.   
</p>

</div>

<div id="outline-container-2.1" class="outline-3">
<h3 id="sec-2.1"><span class="section-number-3">2.1</span> To setup runs on a server: </h3>
<div class="outline-text-3" id="text-2.1">


<ol>
<li>
Configure ED2 on your server 
<ul>
<li>
<a href="/home/pecan/pecan/man/VM_Creation.html">instructions</a> for configuring ED on an Ubuntu Server, based on setup of the present Virtual Machine
</li>
</ul>
</li>
<li>
to generate an ssh key pair, execute the following and follow instructions. This will allow use of a remote server without having to enter a password. 



<pre class="example">~/pecan/bash/sshkey.sh
</pre>


</li>
<li>
change the following nodes under run/host in the <a href="/home/pecan/in/ebifarm/post/pavi.xml">pavi.xml</a> settings file ( to appropriate values for the remote server:
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" />
</colgroup>
<tbody>
<tr><td>xml node:</td><td>name</td><td>rundir</td><td>inputs</td><td>outdir</td></tr>
<tr><td>definition:</td><td>hostname</td><td>location of the ED run executable</td><td>met and driver files</td><td>model output</td></tr>
<tr><td>on VM</td><td>localhost</td><td>~/EDBRAMS/ED/run/</td><td>~/edin/</td><td>~/out/ebifarm/prior/</td></tr>
</tbody>
</table>

</li>
<li>
PEcAn should run on remote server. Note: PEcAn currently supports the PBS TORQUE queuing system (e.g. jobs are started with qsub) 





</li>
</ol>
</div>
</div>
</div>
<div id="postamble">
<p class="author"> Author: PECAN User
<a href="mailto:pecan@pecan">&lt;pecan@pecan&gt;</a>
</p>
<p class="date"> Date: 2012-01-25 12:59:06 CST</p>
<p class="creator">HTML generated by org-mode 6.34c in emacs 23</p>
</div>
</div>
</body>
</html>
